{
  "visual": {
    "navbar": {
      "links": [
        {
          "label": "Projects",
          "path": "#projects"
        },
        {
          "label": "Blogs",
          "path": "#blogs"
        }
      ]
    },
    "home": {
      "sections": {
        "banner": true,
        "experience": true,
        "project": true,
        "education": true,
        "testimonial": true
      }
    }
  },
  "personalInfo": {
    "name": "Excited to connect !",
    "title": "End-to-End Product Engineering Partner",
    "bio": "We’re a team of full-stack engineers, cloud architects, and product designers delivering end-to-end product development—from discovery and UX/UI to full-stack build, cloud/DevOps, and post-launch support. We craft reliable, design-led platforms (SaaS, internal tools, data apps) with clean architecture, testing, CI/CD, and observability, working as embedded partners to ship fast and iterate on real feedback."
  },
  "contactInfo": {},
  "skills": {
    "languages": [
      "JavaScript",
      "Python",
      "Java",
      "C++"
    ],
    "frameworks": [
      "React",
      "Node.js",
      "Express",
      "Django",
      "Spring Boot"
    ],
    "databases": [
      "MySQL",
      "MongoDB",
      "PostgreSQL"
    ],
    "tools": [
      "Git",
      "Docker",
      "Kubernetes",
      "Jenkins",
      "AWS",
      "GCP"
    ]
  },
  "projects": [
    {
      "id": "6",
      "title": "I-NSTEIN",
      "description": "Built I-nstein, a geospatial OSINT platform that ingests ACLED and fuses social-media PAI (X/Twitter, Telegram, VK) to track incidents in real time, render a 3D common intelligence picture with tactical graphics, and provide entity/case management with A-1 to F-6 reliability scoring.",
      "technologies": [
        "Angular",
        ".NET Core",
        "Azure",
        "CesiumJS",
        "Google Maps",
        "ACLED",
        "Twitter API",
        "YouTube API",
        "Telegram API",
        "Facebook API"
      ],
      "live_url": "https://www.i-nstein.app/",
      "cover": "/assets/i-nstein.png"
    },
    {
      "id": "7",
      "title": "Visitor Tracking",
      "description": "Built a real-time web analytics platform that streams live sessions, tracks conversions and funnels, and aggregates insights across unlimited sites. Includes event tracking (clicks, form submits, click-to-call), customer journeys with original-source attribution, and conversion analytics with a 14-day moving average and UTM breakdowns—privacy-friendly (GDPR/CCPA) with optional IP/org identification. 30-second setup with a 7-day free trial.",
      "technologies": [
        "Angular",
        ".NET",
        "TypeScript",
        "Azure App Service"
      ],
      "live_url": "https://visitortracking.com/",
      "cover": "/assets/visitortracking.png"
    },
    {
      "id": "8",
      "title": "MetricsNavigator",
      "description": "Built MetricsNavigator, a Shopify analytics platform that connects to your store and surfaces revenue, retention, and LTV insights. It provides cohort analysis, repeat-purchase and AOV tracking, customizable dashboards, segmentation, and real-time trend monitoring—including payback period tracking—to drive data-driven growth.",
      "technologies": [
        "React",
        "Vite",
        "ApexCharts",
        "Redux",
        "Python",
        "Django",
        "Django REST Framework",
        "Custom ETL Pipeline",
        "PostgreSQL",
        "Google Cloud App Engine",
        "Google Cloud Compute Engine (VM)"
      ],
      "live_url": "https://www.metricsnavigator.ai/",
      "cover": "/assets/metricsnavigator.png"
    },
    {
      "id": "9",
      "title": "Slyce",
      "description": "Built Slyce, an AI-driven restaurant growth platform for delivery apps (e.g., Lieferando, Uber Eats, Wolt). From a single dashboard you can launch promotions/ads across platforms, automate campaign settings with real-time algorithms, and track results end-to-end. The Data module syncs to your warehouse/BI for deep analysis and adds market/competitor monitoring with alerts for changes to campaigns, menus, and revenue. The Operations module provides 24/7 live monitoring with instant store-manager notifications, an aggregated Operations Score with actionable recommendations, automated review analysis/classification, and location/menu management with 1-click re-enable.",
      "technologies": [
        "React",
        "Node.js",
        "Scheduler",
        "Workflow Orchestrator",
        "Message Queue",
        "Google Cloud Pub/Sub",
        "BigQuery",
        "PostgreSQL",
        "Puppeteer",
        "Cloudflare Proxy"
      ],
      "live_url": "https://slyce.io/",
      "cover": "/assets/slyce.png"
    },
    {
      "id": "1",
      "title": "HelloCrowd",
      "description": "Developed Hellocrowd, a cutting-edge event management platform enabling real-time event creation, dynamic ticketing, attendance tracking, and customizable mobile apps, enhancing event efficiency and user experience.",
      "technologies": [
        "Angular",
        "NodeJs",
        "Fastify",
        "Typescript",
        "Firebase",
        "GCP",
        "SSR",
        "SSO Login"
      ],
      "live_url": "https://www.hellocrowd.net/",
      "cover": "/assets/hellocrowd.png"
    },
    {
      "id": "2",
      "title": "DrZio",
      "description": "Designed a health and fitness platform using WordPress, providing seamless navigation, engaging UI, personalized fitness tracking, and integrated payment options, ensuring accessibility and exceeding user expectations.",
      "technologies": [
        "WordPress",
        "PHP",
        "MySQL",
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "live_url": "https://www.drzio.com/",
      "cover": "/assets/drzio.png"
    },
    {
      "id": "3",
      "title": "Outdoor Advertisement",
      "description": "Revolutionizing outdoor advertising with seamless poster management, insightful analytics, and user-friendly experiences for all roles.",
      "technologies": [
        "Typescript",
        "Next.js",
        "Nestjs",
        "TailwindCSS",
        "MongoDB"
      ],
      "live_url": "https://outdoor-advertise.vercel.app/outdoorAd",
      "cover": "/assets/project_1.jpeg"
    }
  ],
  "workExperience": [
    {
      "id": "1",
      "company": "Lanet Team and Solutions",
      "companyWebsite": "https://lanetteam.com/",
      "role": "Software Developer",
      "startDate": "Jun 2024",
      "endDate": "Present",
      "keyResponsibilities": [
        "Designed and developed user-centric web pages using PHP, JavaScript, and CSS, adhering to accessibility standards.",
        "Customized WordPress CMS extensions and developed MySQL-based solutions to meet user requirements for various clients.",
        "Enhanced application performance and user experience, leading to a 30% improvement in application efficiency and a 25% increase in user satisfaction.",
        "Integrated third-party services and APIs to enhance application functionality.",
        "Maintained backend hosting environments on Google Cloud and Firebase.",
        "Collaborated with cross-functional teamsto deliver scalable and high-performing web solutions, ensuring timely deliveryand meeting all project milestones."
      ]
    },
    {
      "id": "2",
      "company": "Lanet Team and Solutions",
      "companyWebsite": "https://lanetteam.com/",
      "role": "Full Stack Developer Intern",
      "startDate": "Jan 2024",
      "endDate": "Jun 2024",
      "keyResponsibilities": [
        "Assisted in the development and maintenance of full stack applications using MEAN stack (MongoDB, Express, Angular, Node.js), NestJS, and Firebase.",
        "Performed debugging, testing, and optimization to improve application performance and user experience.",
        "Supported integration of third-party services and APIs under guidance from senior developers.",
        "Collaborated with cross-functional teams to ensure timely project deliverables and meet milestones."
      ]
    },
    {
      "id": "3",
      "company": "CreArt Solutions",
      "companyWebsite": "https://creart.in/",
      "role": "Web Developer Intern",
      "startDate": "July 2023",
      "endDate": "Dec 2023",
      "technologies": [
        "MongoDB",
        "Express",
        "React",
        "Node.js"
      ],
      "keyResponsibilities": [
        "Designed and developed web applications using Django and Nodejs.",
        "Built and maintained server-side APIs with Node.js and Express.",
        "Collaborated with cross-functional teams to deliver high-quality products.",
        "Ensured applications are responsive and performant.",
        "Participated in Agile ceremonies and contributed to project planning."
      ]
    }
  ],
  "education": [
    {
      "id": "1",
      "institution": "California State University, Long Beach, USA",
      "degree": "Masters in Computer Science",
      "description": "Embarking on a journey to deepen expertise in computer science, with initial coursework focusing on advanced algorithms, artificial intelligence, and software engineering principles. Excited to explore innovative projects and cutting-edge research opportunities in AI and web technologies.",
      "startDate": "Jan 2025",
      "endDate": "Present"
    },
    {
      "id": "2",
      "institution": "LJIET , Ahmedabad Gujarat, INDIA  ",
      "degree": "B.E. in Computer Engineering",
      "description": "Graduated with a strong foundation in computer engineering, excelling in designing and deploying full-stack web applications. Developed hands-on expertise with Nextjs, Node.js, and SQL while delivering scalable and secure solutions. Accomplished significant projects, earning recognition for technical creativity and innovation.",
      "startDate": "Aug 2024",
      "endDate": "May 2024"
    }
  ],
  "testimonials": [
    {
      "id": "1",
      "name": "Ajeet Singh",
      "avatar": "/assets/ajeet.png",
      "title": "CEO",
      "company": "Lanet Team and Solutions",
      "link": "https://lanetteam.com/",
      "feedback": "Vansh is a fantastic developer who consistently delivers high-quality work. His ability to solve complex problems is impressive."
    },
    {
      "id": "2",
      "name": "Krishnamohan Gupta",
      "avatar": "/assets/creArt.jpeg",
      "title": "CEO",
      "company": "CreArt Solutions",
      "link": "https://creart.in/",
      "feedback": "Vansh is a highly skilled developer who brings a lot of value to our projects. His expertise in full stack development is top-notch."
    }
  ]
}